# -*- coding: utf-8 -*-
'''
Задание 4.8

Преобразовать IP-адрес в двоичный формат и вывести на стандартный поток вывода вывод столбцами, таким образом:
- первой строкой должны идти десятичные значения байтов
- второй строкой двоичные значения

Вывод должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов

Пример вывода для адреса 10.1.1.1:
10        1         1         1
00001010  00000001  00000001  00000001

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

ip = '192.168.3.1'
octets = [ int(octet) for octet in ip.split('.') ]

# Solution 1
template = '''
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}
'''
print(template.format(octets[0], octets[1], octets[2], octets[3]))

# Solution 2
octets_bin = [ bin(octet)[2:].zfill(8) for octet in octets ]

template2 = '''
{0:<10}{1:<10}{2:<10}{3:<10}
{4:10}{5:10}{6:10}{7:10}
'''
print(template.format(octets[0], octets[1], octets[2], octets[3], 
	octets_bin[0], octets_bin[1], octets_bin[2], octets_bin[3]))

#Все отлично

#вариант решения
ip = '192.168.3.1'
oct1, oct2, oct3, oct4 = [int(i) for i in ip.split('.')]

output = '''
{0:<10}{1:<10}{2:<10}{3:<10}
{0:08b}  {1:08b}  {2:08b}  {3:08b}'''

print(output.format(oct1, oct2, oct3, oct4))
